app/controllers/api/v1/registrations_controller.rb

INSERT INTO "users" ("email", "encrypted_password", "created_at", "updated_at", "first_name", "last_name", "date_of_birth") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    user = User.new(user_params)
    return render json: { auth_token: user.to_jwt } if user.save