app/controllers/api/v1/sessions_controller.rb

  def create
    user = User.find_by(email: user_params[:email])
---
SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "linda@kertzmann.io"], ["LIMIT", 1]]