app/controllers/api/v1/sightings_controller.rb

  def index
    @sightings = Sighting.page(params[:page]).per(params[:per_page])
---
SELECT  "sightings".* FROM "sightings" LIMIT $1 OFFSET $2  [["LIMIT", 25], ["OFFSET", 0]]

  def show
    @sighting = Sighting.find params[:id]
---
SELECT  "sightings".* FROM "sightings" WHERE "sightings"."id" = $1 LIMIT $2  [["id", 39], ["LIMIT", 1]]